#coding:utf-8
import time
start=time.time()
import re
import codecs
from keras_bert import Tokenizer,load_trained_model_from_checkpoint
from keras.metrics import top_k_categorical_accuracy
from keras.layers import *
from keras_bert import get_custom_objects
from keras.models import load_model,Model
from keras.optimizers import Adam
import numpy as np
# from dataprocess import get_spe_data

# 读取训练集和测试集
# model_path='./bert_dump/model340.hdf5'
model_path='./bert_dump/modelnew343full1.hdf5'
dict_path='../chinese_L-12_H-768_A-12/vocab.txt'
config_path = '../chinese_L-12_H-768_A-12/bert_config.json'
checkpoint_path = '../chinese_L-12_H-768_A-12/bert_model.ckpt'


def acc_top2(y_true, y_pred):
    return top_k_categorical_accuracy(y_true, y_pred, k=2)
def build_bert(nclass):
    bert_model = load_trained_model_from_checkpoint(config_path, checkpoint_path, seq_len=None)  # 加载预训练模型

    for l in bert_model.layers:
        l.trainable = True

    x1_in = Input(shape=(None,))
    x2_in = Input(shape=(None,))

    x = bert_model([x1_in, x2_in])
    x = Lambda(lambda x: x[:, 0])(x)
    # x = layers.Bidirectional(LSTM(units=256, return_sequences=False), merge_mode='sum')(x)
    x = Dense(200, activation='relu')(x)
    p = Dense(nclass, activation='softmax')(x)

    model = Model([x1_in, x2_in], p)
    model.compile(loss='categorical_crossentropy',
                  optimizer=Adam(1e-5),  # 用足够小的学习率
                  metrics=['accuracy', acc_top2])
    print(model.summary())
    return model
def get_result(list,dict_path,model_path,maxlen=500):
    """
    :param list: 合同文本内容的列表  不需要分词
    :param dict_path: 中文bert预训练模型的词汇表位置
    :param model_path: 训练好的模型文件的位置
    :param maxlen: 输入bert模型的长度  不超过512
    :return:返回合同类型名称
    """
    maxlen = maxlen  # 设置序列长度为120，要保证序列长度不超过512
    # 预训练好的模型
    # 词汇表位置
    dict_path = dict_path
    # 将词表中的词编号转换为字典
    token_dict = {}
    with codecs.open(dict_path, 'r', 'utf8') as reader:
        for line in reader:
            token = line.strip()
            token_dict[token] = len(token_dict)

    # 重写tokenizer
    class OurTokenizer(Tokenizer):
        def _tokenize(self, text):
            R = []
            for c in text:
                if c in self._token_dict:
                    R.append(c)
                elif self._is_space(c):
                    R.append('[unused1]')  # 用[unused1]来表示空格类字符
                else:
                    R.append('[UNK]')  # 不在列表的字符用[UNK]表示
            return R

    tokenizer = OurTokenizer(token_dict)

    # 让每条文本的长度相同，用0填充
    def seq_padding(X, padding=0):
        L = [len(x) for x in X]
        ML = max(L)
        return np.array([
            np.concatenate([x, [padding] * (ML - len(x))]) if len(x) < ML else x for x in X
        ])

    # 计算top-k正确率,当预测值的前k个值中存在目标类别即认为预测正确
    def acc_top2(y_true, y_pred):
        return top_k_categorical_accuracy(y_true, y_pred, k=2)

    def top2_list(logits):
        # 获取列表最大两个值的索引
        top1 = np.argmax(logits)
        new_logits=np.delete(logits,np.argmax(logits))
        top2 = np.argmax(new_logits)
        if top1 > top2:
            return [top1, top2]
        else:
            return [top1, top2 +1]

    custon_objects = get_custom_objects()
    custon_objects['acc_top2'] = acc_top2
    # model=build_bert(343)
    # model.load_weights(model_path)
    model=load_model(model_path,custon_objects)
    def get_test_data(i):
        # 获取符合模型的训练数据
        X1 = []
        X2 = []
        i = i[:maxlen]
        x1, x2 = tokenizer.encode(first=i)
        X1.append(x1)
        X2.append(x2)
        X1 = seq_padding(X1)
        X2 = seq_padding(X2)
        return [X1, X2]

    print(get_test_data(list))
    test_model_pred = model.predict(get_test_data(list))
    test_pred_top = top2_list(test_model_pred)
    contract2int={'互易合同': 0, '其他买卖类合同': 1, '农副产品买卖合同': 2, '农资买卖合同': 3, '凭样品买卖合同': 4, '分期付款买卖合同': 5, '回购合同': 6, '土地出让合同': 7, '土地转让合同': 8, '工矿产品买卖合同': 9, '建材买卖合同': 10, '房屋买卖合同': 11, '拍卖合同': 12, '招投标买卖合同': 13, '': 14, '政府采购合同': 15, '汽车买卖合同': 16, '电子产品买卖合同': 17, '经销合同': 18, '船舶买卖合同': 19, '补偿贸易合同': 20, '订购合同': 21, '试用买卖合同': 22, '调拨合同': 23, '购销合同': 24, '进出口买卖合同': 25, '采购合同': 26, '销售代理合同': 27, '附条件买卖合同': 28, '中外合作经营合同': 29, '中外合资经营合同': 30, '公司章程': 31, '其他经营类合同': 32, '兼并合同': 33, '出资协议': 34, '分立合同': 35, '加盟合同': 36, '合伙协议': 37, '合作合同': 38, '合办协议书': 39, '和解协议': 40, '委托经营合同': 41, '房产开发合同': 42, '承包经营合同': 43, '挂靠合同': 44, '收购合同': 45, '改制合同': 46, '特许经营合同': 47, '租赁经营合同': 48, '经营权转让合同': 49, '联营合同': 50, '股权抵押合同': 51, '股权转让合同': 52, '资产转让合同': 53, '资金委托合同': 54, '供气合同': 55, '供水合同': 56, '供热合同': 57, '供电合同': 58, '其他能源供给类合同': 59, '个人养老金保险条款': 60, '人寿保险合同': 61, '企业财产保险合同': 62, '住房保险合同': 63, '保险经纪合同': 64, '健康保险合同': 65, '其他保险类合同': 66, '医疗保险合同': 67, '家庭财产保险合同': 68, '建筑工程保险合同': 69, '意外伤害保险合同': 70, '财产保险合同': 71, '责任保险合同': 72, '货物运输保险合同': 73, '运输工具保险合同': 74, '其他信托类合同': 75, '基金信托合同': 76, '股权信托合同': 77, '财产信托合同': 78, '资产信托合同': 79, '专项资金贷款合同': 80, '买方信贷政府贷款和混合借贷合同': 81, '住房贷款合同': 82, '保证担保借款合同': 83, '信托贷款合同': 84, '信用贷款合同': 85, '借款展期合同': 86, '其他借款类合同': 87, '农业贷款合同': 88, '助学贷款协议': 89, '商业贷款合同': 90, '国际借款合同': 91, '外汇借款合同': 92, '委托贷款合同': 93, '对外承包项目借款合同': 94, '小额借款合同': 95, '工程建设贷款合同': 96, '技术改造借款合同': 97, '抵押担保借款合同': 98, '民间借贷合同': 99, '汽车贷款合同': 100, '流动资金贷款合同': 101, '消费借款合同': 102, '短期借款合同': 103, '联营股本贷款合同': 104, '质押担保借款合同': 105, '资金拆借合同': 106, '转贷款协议': 107, '配套人民币贷款合同': 108, '银团借款合同': 109, '长期借款合同': 110, '业主公约': 111, '保管仓储合同': 112, '赠与合同': 113, '其他承揽类合同': 114, '制作合同': 115, '加工合同': 116, '印刷合同': 117, '复制合同': 118, '安装合同': 119, '定做合同': 120, '搬运合同': 121, '检验合同': 122, '洗护合同': 123, '测绘合同': 124, '生产合同': 125, '维修合同': 126, '鉴定合同': 127, '临时用工合同': 128, '人事代理合同': 129, '人事保管合同': 130, '人事挂靠合同': 131, '保密合同': 132, '借调合同': 133, '停薪留职合同': 134, '其他劳动关系类合同': 135, '劳务合同': 136, '劳务租赁合同': 137, '劳动合同': 138, '员工培训合同': 139, '推荐人才合同': 140, '聘用合同': 141, '试用合同': 142, '集体合同': 143, '保险代理合同': 144, '其他委托行纪居间类合同': 145, '发行代理合同': 146, '外贸代理合同': 147, '委托制作合同': 148, '委托培训合同': 149, '委托审计合同': 150, '委托拍卖合同': 151, '委托持股合同': 152, '委托研发合同': 153, '委托设计合同': 154, '委托评估合同': 155, '居间合同': 156, '广告代理合同': 157, '房产中介合同': 158, '房产代理合同': 159, '招标代理合同': 160, '授权委托书': 161, '法律事务代理合同': 162, '注册代理合同': 163, '物业委托合同': 164, '税务代理合同': 165, '缴款代理合同': 166, '行纪合同': 167, '货运代理合同': 168, '资产委托合同': 169, '进出口代理合同': 170, '邮递委托合同': 171, '其他娱乐体育类合同': 172, '参赛合同': 173, '影视演艺合同': 174, '球员租赁合同': 175, '其他建筑工程类合同': 176, '合建工程合同': 177, '土地征用合同': 178, '工程分包合同': 179, '工程勘察合同': 180, '工程咨询合同': 181, '工程建设廉洁合同': 182, '工程承包合同': 183, '工程招标合同': 184, '工程施工合同': 185, '工程监理合同': 186, '工程设计合同': 187, '房屋拆迁合同': 188, '施工管理合同': 189, '物资设备租赁合同': 190, '补偿安置合同': 191, '装饰装修合同': 192, '设备安装合同': 193, '其他技术类合同': 194, '技术保密合同': 195, '技术合作合同': 196, '技术咨询合同': 197, '技术培训合同': 198, '技术开发合同': 199, '技术服务合同': 200, '技术许可合同': 201, '技术转让合同': 202, '技术进出口合同': 203, '设计合同': 204, '保证合同': 205, '其他担保类合同': 206, '反担保合同': 207, '定金合同': 208, '抵押合同': 209, '质押合同': 210, '其他教育文化类合同': 211, '出国留学合同': 212, '出版合同': 213, '办学合同': 214, '发行合同': 215, '培养研究生合同': 216, '奖学金合同': 217, '就业保障合同': 218, '就业实习合同': 219, '招生代理合同': 220, '教师聘用合同': 221, '策划合同': 222, '约稿合同': 223, '翻译合同': 224, '进修培训合同': 225, '采访合同': 226, '中介服务合同': 227, '保安服务合同': 228, '信息服务合同': 229, '其他服务类合同': 230, '医疗服务合同': 231, '咨询服务合同': 232, '娱乐服务合同': 233, '家政服务合同': 234, '广告合同': 235, '彩票服务合同': 236, '旅店服务合同': 237, '旅游服务合同': 238, '法律服务合同': 239, '清洁服务合同': 240, '物业服务合同': 241, '维护服务合同': 242, '网络电信服务合同': 243, '财会服务合同': 244, '邮政服务合同': 245, '餐饮服务合同': 246, '光船租赁合同': 247, '其他海事海商类合同': 248, '定期租船合同': 249, '海上保险合同': 250, '海上运输合同': 251, '海员劳务合同': 252, '海难救助合同': 253, '港口作业合同': 254, '航次租赁合同': 255, '船舶建造合同': 256, '船舶租赁合同': 257, '中外合作经营企业合同': 258, '中外合资经营企业合同': 259, '中外定期租船合同': 260, '中外航次租船合同': 261, '其他涉外类合同': 262, '国际保险合同': 263, '国际建设工程合同': 264, '国际成套设备项目合同': 265, '国际租赁合同': 266, '国际货物贸易合同': 267, '国际货物运输合同': 268, '国际贷款合同': 269, '国际贸易代理合同': 270, '多式联运合同': 271, '对外加工装配合同': 272, '对外劳务合作合同': 273, '专利申请合同': 274, '专利许可合同': 275, '专利转让合同': 276, '其他知识产权类合同': 277, '商标申请合同': 278, '商标许可合同': 279, '商标转让合同': 280, '版权登记合同': 281, '版权许可合同': 282, '版权转让合同': 283, '知识产权代理合同': 284, '软件开发合同': 285, '软件著作权许可使用合同': 286, '软件著作权转让合同': 287, '企业租赁合同': 288, '其他租赁类合同': 289, '土地租赁合同': 290, '场地租赁合同': 291, '房屋租赁合同': 292, '柜台租赁合同': 293, '汽车租赁合同': 294, '网络空间租赁合同': 295, '融资租赁合同': 296, '设备租赁合同': 297, '主机托管合同': 298, '互联网接入合同': 299, '其他网络信息技术类合同': 300, '域名注册合同': 301, '域名转让合同': 302, '电子商务合同': 303, '网站建设合同': 304, '网络服务合同': 305, '网页制作合同': 306, '软件测试合同': 307, '软件销售合同': 308, '其他投资理财类合同': 309, '外汇交易合同': 310, '委托理财合同': 311, '期货交易合同': 312, '证券上市合同': 313, '证券交易合同': 314, '证券回购合同': 315, '证券承销合同': 316, '证券投资咨询合同': 317, '其他身份关系类协议': 318, '扶养协议': 319, '收养协议': 320, '离婚协议': 321, '财产协议': 322, '遗产协议': 323, '公路运输合同': 324, '其他运输类合同': 325, '包机运输合同': 326, '航空运输合同': 327, '船舶运输合同': 328, '装卸合同': 329, '设备搬迁合同': 330, '货物运输合同': 331, '运输承包合同': 332, '送货合同': 333, '铁路运输合同': 334, '代理缴费合同': 335, '信托合同': 336, '储蓄存款合同': 337, '其他银行业务类合同': 338, '开户合同': 339, '网上银行合同': 340, '还款合同': 341, '银行结算合同': 342}

    int2contract = {value: key for key, value in contract2int.items()}
    top2_result = [re.sub(r"[^\u4e00-\u9fa5]", " ", int2contract[i]) for i in test_pred_top]

    return top2_result

import docx
file='../data/北京市经济适用住房买卖合同.docx'
doc=docx.Document(file)
text=''
for p in doc.paragraphs:
    text=text+p.text
# text1='重庆市非成套公有住房出售 购买 合同重庆市非成套公有住房出售 购买 合同合同编号 mark重庆市非成套公有住房出售 购买 合同出售方 以下简称甲方  mark购买方 以下简称甲方  mark根据 重庆市非成套公有房屋出售管理办法 及相关房改政策的规定 甲 乙双方协商一致 签订如下协议乙方自愿向甲方购买下表所列住房房屋坐落 地区类别建筑结构 间 数建筑面积 其中分摊面 积配套情况甲方同意乙方按以下第mark种方式购买乙方在购房面积控制标准之内的面积 超面积mark平方米按该房地区类别成本价mark元 平方采购买 超面积mark平方米按该房地区的市场价mark元 平方采购买以经评估的价格mark元 平方米 并享受工龄折扣购买 其中年工龄mark年以经评估的价格mark元 平方采购买 不享受工龄折扣以该住房所在地区类别成本价的18 购买乙方按以上方式购买该住房应付房价款mark元 大写 mark拾mark万mark仟mark佰mark拾mark元mark角mark分  此款由乙方在mark年mark月mark日一次性付给甲方 甲方于乙方缴款次月起停收住房租金 甲方提取房价款的30 计mark元建立住房公共维修基金 其余部分金额mark元为甲方的售房收入 住房公共维修基金及售房收入均应由甲方专项交存住房资金管理机构在银行开设的专户乙方购买该房后拥有完全产权 按照 重庆市房改住房再交易管理办法 的规定可依法进入市场交易 在补交土地使用权出让金和按规定缴纳税费后 收入归乙方所有乙方所购住房户内及自用设施的维修由乙方自行负责 其共用部位及共用设施的维修按有关规定执行甲方负责统一办理 房屋所有权证 和 国有土地使用证  办好后即交乙方执存 有关办证的费用由甲 乙方双方按政策规定各自承担其它本合同一式四份 甲 乙方签字盖章并由乙方在合同约定时间交清房价款后生效 本合同甲 乙双方各执一份 并交房地产权属登记机关两份甲方 mark 签章  乙方 mark 签字法定代表人 mark 签章  代理人 mark 签字mark年mark月mark日 mark年mark月mark日'
print(get_result(text,model_path=model_path,dict_path=dict_path,maxlen=256))
